Revit 2026 API

# DuctFlowConfigurationType Enumeration

---

An enumerated type listing all duct flow configuration types for a connector.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DuctFlowConfigurationType
```
```vb
Public Enumeration DuctFlowConfigurationType
```
```cpp
public enum class DuctFlowConfigurationType
```
```fsharp
type DuctFlowConfigurationType
```

| Member name | Value | Description |
| --- | --- | --- |
| Calculated | 0 | Duct flow configuration is calculated. |
| Preset | 1 | Duct flow configuration is preset. |
| System | 2 | Duct flow configuration depends on system. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace